def draw_hangman(num_left_attempts): # Выводит состояние игры. Рисует виселицу в зависимости от попыток
    picture = [
        '''
      _______
      |     |
      |    \\O/
      |     |
      |     /\\
    ----- ''',
        '''
      _______
      |     |
      |    \\O/
      |     |
      |     /
    ----- ''',
        '''
      _______
      |     |
      |    \\O/
      |     |
      |     
    ----- ''',
        '''
      _______
      |     |
      |    \\O/
      |     
      |     
    ----- ''',
        '''
      _______
      |     |
      |    \\O
      |     
      |     
    ----- ''',
        '''
      _______
      |     |
      |     O
      |     
      |     
    ----- ''',
        '''
      _______
      |     |
      |     
      |     
      |     
    ----- '''
    ]
    return picture[num_left_attempts]
